brew "awscli"
brew "mas"
brew "telnet"

cask "alfred"
cask "docker"
cask "dropbox"
cask "hyperswitch"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "karabiner-elements"
cask "notion"
cask "openvpn-connect"
cask "slack"

mas "Irvue", id: 1039633667
mas "LINE", id: 539883307
