File.open("#{ENV['HOME']}/.env").each do |line|
  value = line.strip.split('=')
  ENV[value[0]] = value[1]
end

def is_home?
  ENV['LOCATION'] == 'home'
end

def is_office?
  ENV['LOCATION'] == 'office'
end

tap "hashicorp/tap"

brew "bash"
brew "gh"
brew "node"
brew "rbenv"
brew "ruby-build"
brew "neovim"
brew "deno"
brew "hashicorp/tap/terraform"
brew "telnet"
brew "nmap"
brew "saml2aws"

if OS.mac?
  brew "awscli"
  brew "jq"

  # brewからMac App Storeで公開されているアプリを管理する
  brew "mas"

  cask "alfred"
  cask "claude-code"
  cask "appcleaner"
  cask "bettertouchtool"
  cask "claude"
  cask "orbstack"
  cask "dropbox"
  cask "google-japanese-ime"
  cask "iterm2"
  cask "karabiner-elements"
  cask "microsoft-office"
  cask "notion"
  cask "shottr"
  cask "visual-studio-code"
  cask "1password"
  cask "vlc"
  cask "zoom"

  if is_home?
    cask "google-chrome"
    cask "qfinder-pro"
    cask "slack"
  end

  mas "Irvue", id: 1039633667
  mas "LINE", id: 539883307
end
