File.open("#{ENV['HOME']}/.env").each do |line|
  value = line.strip.split('=')
  ENV[value[0]] = value[1]
end

def is_home?
  ENV['LOCATION'] == 'home'
end

def is_office?
  ENV['LOCATION'] == 'office'
end

brew "neovim"
brew "telnet"
brew "nmap"

if OS.mac?
  brew "awscli"
  brew "jq"

  # brewからMac App Storeで公開されているアプリを管理する
  brew "mas"

  cask "alfred"
  cask "appcleaner"
  cask "bettertouchtool"
  cask "docker"
  cask "dropbox"
  cask "google-japanese-ime"
  cask "iterm2"
  cask "karabiner-elements"
  cask "microsoft-office"
  cask "notion"
  cask "skitch"
  cask "visual-studio-code"
  cask "1password"
  cask "zoom"

  if is_home?
    cask "google-chrome"
    cask "qfinder-pro"
    cask "slack"
    cask "vlc"
  end

  mas "Irvue", id: 1039633667
  mas "LINE", id: 539883307
end
