File.open("#{ENV['HOME']}/.env").each do |line|
  value = line.strip.split('=')
  ENV[value[0]] = value[1]
end

def is_home?
  ENV['LOCATION'] == 'home'
end

def is_office?
  ENV['LOCATION'] == 'office'
end

brew "neovim"
brew "deno"

if OS.mac?
  ######################################################################
  # brew
  ######################################################################
  brew "awscli"
  brew "docker"
  brew "docker-compose"
  brew "lima"

  # brewからMac App Storeで公開されているアプリを管理する
  brew "mas"

  brew "telnet"
  brew "tmux"

  if is_home?
    brew "nmap"
  end

  ######################################################################
  # cask
  ######################################################################
  cask "alfred"
  cask "appcleaner"
  cask "bettertouchtool"
  # cask "docker"
  cask "dropbox"
  cask "hyperswitch"
  cask "google-japanese-ime"
  cask "iterm2"
  cask "karabiner-elements"
  cask "microsoft-office"
  cask "microsoft-remote-desktop"
  cask "notion"
  cask "openvpn-connect"
  cask "sequel-ace"
  cask "skitch"
  cask "visual-studio-code"

  # experimental
  brew "go"

  if is_home?
    cask "google-chrome"
    cask "qfinder-pro"
    cask "slack"
    cask "vlc"
  end

  ######################################################################
  # mas
  ######################################################################
  mas "Irvue", id: 1039633667
  mas "LINE", id: 539883307
end
